{"Autodesk":{"title":"Autodesk Software Installation Guide","links":[],"tags":[],"content":"Introduction\nAutodesk is a leading force in the design and BIM industries, widely recognised for its extensive range of software solutions and large global user base. In OENG1191, we will be utilising the following Autodesk software:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNameDescriptionRevitRevit is a powerful BIM software that enables architects, engineers, and designers to create, coordinate, and manage building information models with precision and efficiency.Robot Structural Analysis ProfessionalRobot Structural Analysis Professional is an advanced structural analysis software that enables engineers to simulate, analyse, and optimise complex building and infrastructure designs with precision and efficiencyNavisworks ManageNavisworks Manage is a comprehensive project review software that enables teams to integrate, visualize, and coordinate multidisciplinary models, detect clashes, and improve construction planning and collaboration\nCreate account with education access\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStepsTo do1Go to this Autodesk education access website. (Right click and open link in new tab)2Click Sign in on top right of the page.3In the following Sign in page, click Create account.4Use your RMIT student email to create account.5Now you can proceed to get access to specific software\n\n\n                  \n                  For students who have previously applied for an Autodesk education account: \n                  \n                \n\nAn Autodesk education account is valid for only one year and requires annual renewal. The expiration date of software products under the education account aligns with the account itself. If you have previously applied for an Autodesk education account, please refer to Step 10 - 12 to check the account’s expiration date and renew it accordingly.\n\n\nAcquire access of software\nThe following steps use Revit as an example. Please find the corresponding software and repeat the steps for other software\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStepsTo do6Logging in to the Autodesk education website again. (Right click and open link in new tab)7Find the required software on the page and click on Select.8In the next page, click Access products.9Confirm you subscription in the next page.\nCheck your subscriptions\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStepsTo do10Logging in to the Autodesk education website again. (Right click and open link in new tab)11Click the profile logo on the top right, and click Products and services.12In the All Products and Services page, go to Subscriptions and Contracts under Billings and Orders on the left bar. Expire dates will shown here.\nDownload software\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStepsTo do13Logging in to the Autodesk education website again. (Right click and open link in new tab)14Click the profile logo on the top right, and click Products and services.15Next, due to issues with the Autodesk website, finding the software may be counterintuitive and misleading.16Under All Products and Services page, you MAY NOT find all the software you just got access. If you do find any, click on Install. This will trigger download of a tiny installer. Make sure you are downloading the latest 2025 version.17If you still have missing software, go to Home tab on top left the page.18Some software may show up in the Get Started section on this page. If there is any, click on Install. This will trigger download of a tiny installer.19To install these software, begin by running the installer which will handle the downloading and installation of the software. This process may take some time to complete.\n\n\n                  \n                  Note that even if you choose to install Revit and Navisworks on a drive other than C:, these applications will still use a significant amount of space on the C:\\ drive. It&#039;s advisable to free up some space on C:\\ before starting the installation process. \n                  \n                \n\nAdditional library for Revit\nRevit Additional Library - Australian provides region-specific content, such as templates, families, and annotations, tailored for architectural and engineering projects in Australia\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStepsTo do20Go to All Products and Services page, refer to step 10 - 11.21Find Revit, and click View details at the bottom of the block22In the following page, go to Libraries.23Find the Australia content package24Download and install the package."},"Revizto":{"title":"Revizto Platform","links":[],"tags":[],"content":"Revizto is a cloud-based BIM coordination tool that integrates models, drawings, and issue tracking in one platform. It enhances BIM workflows by enabling real-time collaboration, clash detection, and VR/3D navigation. Compatible with Revit, Navisworks, and other BIM software, Revizto helps teams streamline communication, reduce errors, and improve project efficiency.\nReceiving and Accessing the Installation Email\nWe will send an invitation email to enrolled students at the appropriate time. Students must use the link provided in their email to proceed with the installation. Please note that this software is invitation-based, meaning you can only install it using your own email. If you have not received your personal invitation, you cannot complete the installation using a forwarded email from someone else."},"Unity":{"title":"Unity Engine Installation Guide","links":[],"tags":[],"content":"Unity is a real-time 3D platform that enhances BIM with interactive visualisation, VR/AR experiences, and real-time rendering. With tools like Unity Reflect, it integrates with BIM software (e.g., Revit, Navisworks) to:\n\nVisualise BIM models in real-time with high-quality rendering.\nEnable VR/AR experiences for design reviews and collaboration.\nSimulate construction processes to improve planning and coordination.\n\nGet Unity Hub\nUnity Hub is a tool for managing Unity versions, projects, and services. It is required for installing Unity Engine to ensure compatibility and streamline updates.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStepsTo do1Go to Unity download page Here. (Right click and open link in new tab)2Download Unity Hub for Windows3Run the download file to install.4Start Unity Hub, you should see the page as below:\nRegister for Unity ID\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStepsTo do5Click on create account, it will jump to web browser. Follow the steps to create your Unity ID with you RMIT student email.6Then Sign in the Unity Hub with you new Unity ID. The process will bring you back to web browser again to login in, and then you can click Open Unity Hub to return7After first log in, Unity Hub will ask you to install a Unity Editor, click on skip installation for now.\nUnity Student Plan\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStepsTo do8In Unity Hub, Click the triangle on top left, in the dropdown, click Manage licenses.9In the new pop-up, click Add license.10In the following pop-up, find Get a Unity Student license.11This will bring you to web browser. In the new web page, click Free access: post-secondary.12You will first encounter the page below. Click on Continue and follow all the steps until you see the page ==again==.13Click on Continue again, and you should be directed to a congratulatory page. This means you have successfully completed the process. Now check your email. You should have one email from SheerID and 2 emails from Unity Technologies. The license key for Unity Student seat is in one of the email.\nActivate your student license\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStepsTo do14Repeat step 8 and 9. Select Activate with a serial number this time.15Fill in your key. You should able to see Pro licence as below:\nInstall the editor\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStepsTo do16In Unity Hub, choose Installs on the left bar, then Install Editor on the top right.17Choose to install Unity 618In the following page, make sure Microsoft Visual Studio is checked. And then install the editor.\n\n\n                  \n                  Unity updates frequently, so please ensure you use the required version specified for this course. \n                  \n                \n"},"index":{"title":"Welcome to OENG1191","links":["Autodesk","Unity","Revizto"],"tags":[],"content":"\nHardware Requirements\nTo complete OENG1191, a Windows laptop is essential because:\n\nThe course relies on industry-specific software that only runs on Windows.\nUni desktops may lack required software or have outdated versions, causing compatibility issues.\nA Windows desktop at home may limit collaboration on group projects.\n\n\nIf you don’t have a Windows laptop, consider withdrawing from the course.\nSoftware Required\nPlease ensure that you have the following software installed before the course begins:\n\nAutodesk Software\nUnity Engine\nRevizto Platform\n\nFAQ\n\n\n                  \n                  Do I need a powerful laptop? \n                  \n                \n\nThe projects in this course are relatively small, so a laptop that meets the minimum software requirements is usually sufficient. We recommend referring to the minimum system requirements for Autodesk and Unity to ensure compatibility.\nAutodesk: www.autodesk.com/support/technical/article/caas/sfdcarticles/sfdcarticles/System-requirements-for-Revit-2025-products.html\nUntiy:\ndocs.unity3d.com/6000.0/Documentation/Manual/system-requirements.html\n\n\n\n\n                  \n                  Do I need programming knowledge? \n                  \n                \n\nThis course involves programming, but the focus is not on writing code from scratch. We will provide the necessary code, but you are expected to understand its functionality and make minor modifications for your assignments.\n\n"}}