{"Autodesk":{"title":"Autodesk Software Installation Guide","links":[],"tags":[],"content":"Create account and get licence\n\nGo to this Autodesk website. (Right click and open link in new tab)\nClick Sign in on top right.\n\n\n\n\nIn the following Sign in page, click Create account.\n\n\n\n\nUse your RMIT student email to create account.\nThe access to the software will automatically granted after registration.\n\n\n\n                  \n                  For students who have previously applied for an Autodesk education account: \n                  \n                \n\nRemember that your education account requires annual renewal. Please first check your email for any renewal notifications from Autodesk. You can renew your account through the link provided in the email, or by logging into the website in step 1 to complete the renewal process.\n\n\nDownload Software\n\nLog in this Autodesk website again. (Right click and open link in new tab)\nSelect Revit.\n\n\n\n\nIn the next page, click Access products.\nNow you will be directed to All Products and Services page.\nFind Navisworks Manage and Revit, click on Install. This will trigger download of 2 tiny installers.\n\n\n\n\n\nTo install Revit and Navisworks Manage, begin by running the installer which will handle the downloading and installation of the software. This process may take some time to complete.\n\n\n\n                  \n                  Note that even if you choose to install Revit and Navisworks on a drive other than C:, these applications will still use a significant amount of space on the C:\\ drive. It&#039;s advisable to free up some space on C:\\ before starting the installation process. \n                  \n                \n\nAdditional library for Revit"},"Bentley":{"title":"Bentley Software Installation Guide","links":[],"tags":[],"content":"Create and setup account\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStepsTo do1Go to this Bentley education website. (Right click and open link in new tab)2Click Log in on top right.3In the following page, click Register now.4Create an account with RMIT student email address.5Check your e-mail (check the junk mail as well) for verification code. Enter the code and click the Verify button.6Sign in to your account7You’ll see this pop-up window. Click SETUP to update your profile8In the following page, click My Profile.9Fill the Bentley Education Profile (Fields marked with * are mandatory) and click the Save button.10Now the access to the software is granted\nDownload Software\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStepsTo do1While signed in, click Software on the top bar.2Under Structural Analysis, download and install RAM Structural System.3Under iTwin Products, download and install iTwin Capture Modeler."},"Code-demo":{"title":"Code demo","links":["files/test.pdf"],"tags":[],"content":"This page is to demonstrate the code block:\nusing UnityEngine;\n \npublic class SimpleController : MonoBehaviour\n{\n    public float speed = 5.0f;      \n    public float rotationSpeed = 100.0f; \n \n    void Update()\n    {\n        float translation = Input.GetAxis(&quot;Vertical&quot;) * speed;\n        float rotation = Input.GetAxis(&quot;Horizontal&quot;) * rotationSpeed;\n \n        translation *= Time.deltaTime;\n        rotation *= Time.deltaTime;\n \n        transform.Translate(0, 0, translation);\n        transform.Rotate(0, rotation, 0);\n    }\n}\n \nimport unreal\n \nselected_actors = unreal.EditorLevelLibrary.get_selected_level_actors()\n \nif selected_actors:\n    actor = selected_actors[0]\n    move_speed = 100.0\n    rotation_speed = 10.0\n \n    move_vector = unreal.Vector(0, 0, move_speed)\n    rotation = unreal.Rotator(0, rotation_speed, 0)\n \n    actor.add_actor_local_offset(move_vector, True)\n    actor.add_actor_local_rotation(rotation, True)\nelse:\n    print(&quot;No actors selected in the editor&quot;)\n \ntest download: test.pdf\n"},"index":{"title":"Welcome to OENG1191","links":["Autodesk"],"tags":[],"content":"\nHardware Requirements\nTo successfully complete OENG1191, you will need a Windows laptop. The course utilises numerous industry-specific software applications, many of which are only compatible with Windows and cannot be installed on the desktop computers provided by the uni. Additionally, having only a Windows desktop computer may pose challenges during group assignments. If you do not have access to a Windows laptop, it is recommended that you consider withdrawing from this course.\nSoftware Requirements\nPlease ensure that you have the following software installed before the course begins:\n\nAutodesk Revit and Navisworks Manage\nBentley RAM Structural System\nUnity Engine\nRevizto Platform\n\nNCP Program\nFAQ\n\n\n                  \n                  Do I need a powerful laptop? \n                  \n                \n\nNo\n\n\n\n\n                  \n                  Do I need to know programming? \n                  \n                \n\nNo\n\n\n\n\n                  \n                  Q3 \n                  \n                \n\nNo\n\n\n\n\n                  \n                  Q4 \n                  \n                \n\nNo\n\n\n\n\n                  \n                  Q5 \n                  \n                \n\nNo\n\n"}}