{"Autodesk":{"title":"Autodesk Software Installation Guide","links":[],"tags":[],"content":"Introduction\nAutodesk is a leading force in the design and BIM industries, widely recognised for its extensive range of software solutions and large global user base. In OENG1191, we will be utilising the following Autodesk software:\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nNameDescriptionRevitRevit is a powerful BIM software that enables architects, engineers, and designers to create, coordinate, and manage building information models with precision and efficiency.Robot Structural Analysis ProfessionalRobot Structural Analysis Professional is an advanced structural analysis software that enables engineers to simulate, analyse, and optimise complex building and infrastructure designs with precision and efficiencyNavisworks ManageNavisworks Manage is a comprehensive project review software that enables teams to integrate, visualize, and coordinate multidisciplinary models, detect clashes, and improve construction planning and collaboration\nCreate account with education access\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStepsTo do1Go to this Autodesk education access website. (Right click and open link in new tab)2Click Sign in on top right of the page.3In the following Sign in page, click Create account.4Use your RMIT student email to create account.5Now you can proceed to get access to specific software\n\n\n                  \n                  For students who have previously applied for an Autodesk education account: \n                  \n                \n\nAn Autodesk education account is valid for only one year and requires annual renewal. The expiration date of software products under the education account aligns with the account itself. If you have previously applied for an Autodesk education account, please refer to Step 10 - 12 to check the account’s expiration date and renew it accordingly.\n\n\nAcquire access of software\nThe following steps use Revit as an example. Please find the corresponding software and repeat the steps for other software\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStepsTo do6Logging in to the Autodesk education website again. (Right click and open link in new tab)7Find the required software on the page and click on Select.8In the next page, click Access products.9Confirm you subscription in the next page.\nCheck your subscriptions\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStepsTo do10Logging in to the Autodesk education website again. (Right click and open link in new tab)11Click the profile logo on the top right, and click Products and services.12In the All Products and Services page, go to Subscriptions and Contracts under Billings and Orders on the left bar. Expire dates will shown here.\nDownload software\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStepsTo do13Logging in to the Autodesk education website again. (Right click and open link in new tab)14Click the profile logo on the top right, and click Products and services.15Next, due to issues with the Autodesk website, finding the software may be counterintuitive and misleading.16Under All Products and Services page, you MAY NOT find all the software you just got access. If you do find any, click on Install. This will trigger download of a tiny installer. Make sure you are downloading the latest 2025 version.17If you still have missing software, go to Home tab on top left the page.18Some software may show up in the Get Started section on this page. If there is any, click on Install. This will trigger download of a tiny installer.19To install these software, begin by running the installer which will handle the downloading and installation of the software. This process may take some time to complete.\n\n\n                  \n                  Note that even if you choose to install Revit and Navisworks on a drive other than C:, these applications will still use a significant amount of space on the C:\\ drive. It&#039;s advisable to free up some space on C:\\ before starting the installation process. \n                  \n                \n\nAdditional library for Revit\nRevit Additional Library - Australian provides region-specific content, such as templates, families, and annotations, tailored for architectural and engineering projects in Australia\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nStepsTo do20Go to All Products and Services page, refer to step 10 - 11.21Find Revit, and click View details at the bottom of the block22In the following page, go to Libraries.23Find the Australia content package24Download and install the package."},"Code-demo":{"title":"Code demo","links":["files/test.pdf"],"tags":[],"content":"This page is to demonstrate the code block:\nusing UnityEngine;\n \npublic class SimpleController : MonoBehaviour\n{\n    public float speed = 5.0f;      \n    public float rotationSpeed = 100.0f; \n \n    void Update()\n    {\n        float translation = Input.GetAxis(&quot;Vertical&quot;) * speed;\n        float rotation = Input.GetAxis(&quot;Horizontal&quot;) * rotationSpeed;\n \n        translation *= Time.deltaTime;\n        rotation *= Time.deltaTime;\n \n        transform.Translate(0, 0, translation);\n        transform.Rotate(0, rotation, 0);\n    }\n}\n \nimport unreal\n \nselected_actors = unreal.EditorLevelLibrary.get_selected_level_actors()\n \nif selected_actors:\n    actor = selected_actors[0]\n    move_speed = 100.0\n    rotation_speed = 10.0\n \n    move_vector = unreal.Vector(0, 0, move_speed)\n    rotation = unreal.Rotator(0, rotation_speed, 0)\n \n    actor.add_actor_local_offset(move_vector, True)\n    actor.add_actor_local_rotation(rotation, True)\nelse:\n    print(&quot;No actors selected in the editor&quot;)\n \ntest download: test.pdf\n"},"NCP":{"title":"NCP Program","links":[],"tags":[],"content":"The New Colombo Plan (NCP) Scholarships are an Australian government initiative that provides funding for undergraduate students to study and undertake internships in the Indo-Pacific region, fostering cross-cultural ties and regional engagement.\n"},"Revizto":{"title":"Revizto Platform","links":[],"tags":[],"content":"Revizto is a cloud-based BIM coordination tool that integrates models, drawings, and issue tracking in one platform. It enhances BIM workflows by enabling real-time collaboration, clash detection, and VR/3D navigation. Compatible with Revit, Navisworks, and other BIM software, Revizto helps teams streamline communication, reduce errors, and improve project efficiency.\nInstallation\nRevizto licenses are invite-based. We will send invitations at the appropriate time, and you will receive an email. Follow the link in the email to register and download the software."},"Unity":{"title":"Unity Engine Installation Guide","links":[],"tags":[],"content":"Unity is a real-time 3D platform that enhances BIM with interactive visualisation, VR/AR experiences, and real-time rendering. With tools like Unity Reflect, it integrates with BIM software (e.g., Revit, Navisworks) to:\n\nVisualise BIM models in real-time with high-quality rendering.\nEnable VR/AR experiences for design reviews and collaboration.\nSimulate construction processes to improve planning and coordination.\n\nInstallation\nThe Unity website provided a detailed installation workflow:\n\nGo to unity.com/download\nDownload and install Unity Hub.\nRegister an Unity ID account with your RMIT student email.\nLog in Unity Hub with your Unity ID.\nIn the Unity Hub, install Unity.\n\n\n\n                  \n                  Unity updates frequently, so please ensure you use the required version specified for this course. \n                  \n                \n"},"index":{"title":"Welcome to OENG1191","links":["Autodesk","Unity","Revizto","NCP"],"tags":[],"content":"\nHardware Requirements\nTo complete OENG1191, a Windows laptop is required. Here are the reasons:\n\nThe course utilises numerous industry-specific software applications, many of which are only compatible with Windows.\nAlthough university desktops are available, they cannot install some required software and often run outdated versions. Some course content is incompatible with older versions, making a Windows laptop essential.\nA Windows desktop at home may also hinder group work.\nIf you don’t have a Windows laptop, consider withdrawing from the course.\n\nSoftware Requirements\nPlease ensure that you have the following software installed before the course begins:\n\nAutodesk Revit, Robot  Structural Analysis and Navisworks Manage\nUnity Engine\nRevizto Platform\n\nNCP Program\nRead more Here.\nFAQ\n\n\n                  \n                  Do I need a powerful laptop? \n                  \n                \n\nNo\n\n\n\n\n                  \n                  Do I need to know programming? \n                  \n                \n\nNo\n\n\n\n\n                  \n                  Q3 \n                  \n                \n\nNo\n\n\n\n\n                  \n                  Q4 \n                  \n                \n\nNo\n\n\n\n\n                  \n                  Q5 \n                  \n                \n\nNo\n\n"}}